<a href="https://colab.research.google.com/github/thooks630/DSCI_210_R_notebooks/blob/main/lecture_7_3_reshaping_table_in_R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Stacking and Unstacking in R

# Stack and Unstack


In the `tidyr` package:
* Stack $\rightarrow$ `gather`
* Unstack $\rightarrow$ `spread`

In [ ]:
library(dplyr)
library(tidyr)

## Stacking columns with `gather()`

The function `gather` from the `tidyr` library is used to stack columns.

The arguments are:

1. label column name 
2. data column name
3. then a list of columns to stack

##### Imperative syntax:
```{R}
new_df <- gather(old_df, key = "type_label", value = "data_label", col1, col2, col3, ...)
```

##### Piping syntax:
```{R}
data %>% 
  gather(key = "type_label", value = "data_label", col1, col2, col3, ...)
```

### A familiar example

In [7]:
sales <- read.csv("https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/auto_sales.csv")
sales

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

#### Option 1: Spell out all stacking columns

In [ ]:
stacked_sales <- (
  sales 
    %>% gather(key = "auto_type",
               value = "num_sales", 
               Compact, Sedan, SUV, Truck)
)
head(stacked_sales)

#### Option 2: Refer to column range

In [ ]:
stacked_sales <- (
  sales 
    %>% gather(key = "auto_type",
               value = "num_sales",
               Compact:Truck)
)
head(stacked_sales)

#### Option 3: Select by exclusion

In [13]:
stacked_sales <- (
  sales 
    %>% gather(key = "auto_type",
               value = "num_sales",
               -Salesperson)
)
head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Bob         Compact   19
3 Yolanda     Compact   19
4 Xerxes      Compact   12
5 Ann         Sedan     18
6 Bob         Sedan     12


## <font color="red"> Exercise 7.3 - Problem 1 </font>

Notice that the years are all in separate columns in the `world_bank_fresh_download.csv` file.

In [14]:
world_bank = read.csv("https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/world_bank_fresh_download.csv")
head(world_bank)

  Country Region Indicator        X1960        X1961        X1962
1 Algeria Africa Total_population 1.112489e+07 1.140486e+07 1.169015e+07
2 Algeria Africa CO2_emissions    5.537636e-01 5.318100e-01 4.849537e-01
3 Algeria Africa Life_expectancy  4.613512e+01 4.659032e+01 4.704500e+01
4 Algeria Africa Internet_usage             NA           NA           NA
5 Angola  Africa Total_population 5.270844e+06 5.367287e+06 5.465905e+06
6 Angola  Africa CO2_emissions    1.043571e-01 8.471841e-02 2.160253e-01
  X1963        X1964        X1965        X1966        ⋯ X2006
1 1.198513e+07 1.229597e+07 1.262695e+07 1.298027e+07 ⋯ 3.374933e+07
2 4.528245e-01 4.595689e-01 5.224485e-01 6.494806e-01 ⋯ 2.990267e+00
3 4.749620e+01 4.794190e+01 4.837610e+01 4.879080e+01 ⋯ 7.255771e+01
4           NA           NA           NA           NA ⋯ 7.375985e+00
5 5.565808e+06 5.665701e+06 5.765025e+06 5.863568e+06 ⋯ 1.854147e+07
6 2.068771e-01 2.161741e-01 2.060890e-01 2.651641e-01 ⋯ 1.200877e+00
  X2007        X2008        X2009        X2010        X2011        X2012
1 3.426197e+07 3.481106e+07 3.540179e+07 3.603616e+07 3.671713e+07 3.743943e+07
2 3.189978e+00 3.205183e+00 3.428472e+00 3.309912e+00 3.316038e+00           NA
3 7.289837e+01 7.321932e+01 7.352102e+01 7.380405e+01 7.407000e+01 7.432410e+01
4 9.451191e+00 1.018000e+01 1.123000e+01 1.250000e+01 1.400000e+01 1.522803e+01
5 1.918391e+07 1.984225e+07 2.052010e+07 2.121995e+07 2.194230e+07 2.268563e+07
6 1.311096e+00 1.369425e+00 1.430873e+00 1.401654e+00 1.354008e+00           NA
  X2013        X2014        X2015
1 3.818614e+07 3.893433e+07 39666519
2           NA           NA       NA
3 7.456895e+01 7.480810e+01       NA
4 1.650000e+01 1.809000e+01       NA
5 2.344820e+07 2.422752e+07 25021974
6           NA           NA       NA

**Question:** Why is this a violation of the Golden Rule?

> Your answer here

**Task:** Fix this issue as described below.

1. Use `gather` in a pipe to stack all these columns.  Store the years in a column called `year` and the number in a column called `values`.
2. Use `mutate`, `gsub`, and `as.numeric` to clean up the resulting `year` column and convert it to a numeric column.
3. Save the resulting dataframe to an ojbect named `world_bank_stacked`.

In [ ]:
# Your code here

## Unstacking columns with `spread()`
 
The function `spread`, also from the `tidyr` library, is used to unstack columns.

Arguments:

1. Column to split on
2. Column to split

#### Imperative syntax:

```{r}
new_df <- spread(old_df, key = col1, value = col2)
```
#### With Piping:

```{r}
data %>% 
  spread(key = col1, value = col2)
```

#### A simple unstack

In [15]:
head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Bob         Compact   19
3 Yolanda     Compact   19
4 Xerxes      Compact   12
5 Ann         Sedan     18
6 Bob         Sedan     12

In [ ]:
(stacked_sales 
 %>% spread(key = auto_type,
            value = num_sales)
 )

## <font color="red"> Exercise 7.3 - Problem 2 </font>

Continuing with the example from Problem 1 above, notice that the labels in the `Indicator` column are actually variables.

In [ ]:
head(world_bank_stacked)

**Question:** Why is this a violation of the Golden Rule?

> Your answer here

**Task:** Fix this issue as follows:

1. Use `spread` in a pipe to unstack all these labels into their own columns.
2. Save the resulting dataframe to an object named `world_bank_clean`.

In [ ]:
# Your code here

## The stack + mutate + aggregate +  unstack trick

Recall that we can use stacking and unstacking columns to automate applying the same transformation to many columns.

### Example - Recoding auto sales

In [32]:
(sales 
 %>% gather(key = "auto_type",
            value = "num_sales",
            Compact:Truck) 
 %>% mutate(car_type = recode(auto_type,
                             `Compact` = 'car',
                             `Sedan` = 'car',
                             `SUV` = 'utility',
                             `Truck` = 'utility')) 
 %>% group_by(Salesperson, 
              car_type) 
 %>% summarize(total_sales = sum(num_sales)) 
 %>% spread(key = car_type, 
            value = total_sales)
 )
 sales

`summarise()` has grouped output by 'Salesperson'. You can override using the `.groups` argument.

  Salesperson car utility
1 Ann         40  27
2 Bob         31  37
3 Xerxes      35  27
4 Yolanda     27  47

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

## <font color="red"> Exercise 7.3 - Problem 3 </font>

Recall that the MoMA `Artist.csv` data had two columns (`BeginDate` and `EndDate`) that needed to be cleaned up by  replacing zeros with a better representation of missing values, namely `NA` in R. 

Since we need to perform the same transformations on both columns, we can use the stack + transform + unstack trick to clean both columns at once.

In [ ]:
artist = read.csv("https://github.com/MuseumofModernArt/collection/raw/master/Artists.csv")
head(artist)

**Task:** Fix this issue as follows:

1. Use `gather` to stack the two columns.
2. Use `mutate` and `ifelse` to replace all zeros with `NA`.
3. Use `spread` to unstack the two columns, this time giving them more meaningful names.

In [ ]:
# Your code here

## <font color="red"> Exercise 7.3 - Problem 4 </font>

In this problem we will once again visualize the effect of the introduction of the  designated hitter, by comparing the best overall team-wide earned run average (ERA) for each league. 

Recall the `Teams.csv` file. This file contains, for each season, team-by-team statistics.  We will focus on the ERA, which measures the average number of runs allowed by each team’s pitchers over a 9-inning game, with a smaller number indicating better pitching + defense. 
Your job is to recreate the following graph.  

<img src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/img/min_era.png"/>

In [ ]:
teams <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/Teams.csv')
head(teams)

**Tasks:**

1. Filter the data to only the years after World War II (1946+).
2. Group and aggregate the data to compute the minimum ERA for each league for each season.
3. Split the min(ERA) by the leagues so that you have the two columns of min(ERA) values—one for each league—with one row per year.
4. Compute AL – NL, storing the result in a new column.
5. Stack the data for the AL, NL, and AL – NL, with the labels column called Type and the data column called min(ERA).
6. Save the resulting data frame to a variable named `min_era_by_league`

In [ ]:
# Your code here

Finally, note that the `ggplot2` library can be used to create the graph.  Since creating plots with `ggplot2` is outside the scope of the course, the code needed to create this plot is provided below.  

**Note:** Creating plots in `ggplot2` is covered in detail in DSCI 310, which is offered next fall.  If you enjoy creating visualizations, think about taking this course!

In [ ]:
library(ggplot2)

ggplot(min_era_by_league) +
  geom_line(aes(x = yearID, y = min_era, color = league)) +
  geom_hline(yintercept = 0) +
  geom_vline(xintercept = 1973, linetype = "dotted") +
  annotate("text", x = 1958, y = 1, label = "DH introduced to the AL in 1973", size = 3)

In [ ]:
library(ggplot2)

ggplot(min_era_by_league) +
  geom_line(aes(x = yearID, y = min_era, color = league)) +
  geom_hline(yintercept = 0) +
  geom_vline(xintercept = 1973, linetype = "dotted") +
  annotate("text", x = 1958, y = 1, label = "DH introduced to the AL in 1973", size = 3)

# Translating JMP to `dplyr/tidyr`

### Stack/`gather`

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/translate_gather_0.png">

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/translate_gather_1.png">

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/translate_gather_2.png">

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/translate_gather_3.png">

### Unstack/`spread()`

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/unstack_1.png">

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/unstack_2.png">

<img width="850" src="https://raw.githubusercontent.com/WSU-DataScience/DSCI_210_R_notebooks/main/img/unstack_3.png">